---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MismatchNoAvailableConnector
source: html/ced4b478-5137-ac0f-f080-26b56d8097e1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MismatchNoAvailableConnector Property

Cannot add [Element] to System. There is no available connector matching the System Type ([Type Name]) for the System.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchNoAvailableConnector { get; }
```